package com.zjk.yak.ui.action;

import android.app.Activity;
import android.os.Bundle;
import android.view.Menu;

import com.zjk.yak.R;
import com.zjk.yak.ui.adapter.ScanViewAdapter;
import com.zjk.yak.ui.widget.PageView;

import java.util.ArrayList;
import java.util.List;

public class PageActivity extends Activity
{
	PageView scanview;
	ScanViewAdapter adapter;
    String str = "ཉེ་སྔོན། ཀྲུང་དབྱང་མི་རིགས་སློབ་གྲྭ་ཆེན་མོའི་དགེ་རྒན་གཡང་མོ་མཚོས་བརྩམས་པའི《གཉའ་ཁྲི་བཙན་པོ་ཞིབ་འཇུག》ཅེས་པའི་དཔེ་དེབ་དེ་ཀྲུང་གོའི་བོད་རིག་པ་དཔེ་སྐྲུན་ཁང་གིས་པར་བསྐྲུན་འགྲེམ་སྤེལ་གནང་བ་རེད།\n" +
			"\n" +
			"རྩོམ་སྒྲིག་པའི་གཏམ།\n" +
			"\n" +
			"     རྩོམ་པ་པོ་གཡང་མོ་མཚོ་ལགས་ཀྱི《གཉའ་ཁྲི་བཙན་པོ་ཞིབ་འཇུག》ཅེས་པའི་དེབ་འདིའི་མ་ཕྱི་ལྡེབ་མ་སྟོང་ལྷག་ཅན་དེ་ཐོག་མར་ངའི་ལག་ཏུ་གཏད་དུས། ངས་ནི་ལྷ་སྒྲུང་གི་བྱུང་བ་རབ་རིབ་ཙམ་ལས་མེད་པའི་གཉའ་ཁྲི་བཙན་པོའི་སྐོར་ལ་མཐུག་པོ་འདི་འདྲ་ཅི་ཞིག་བྲིས་ཡོད་པ་ཡིན་ནམ་སྙམ་དུ་དང་པོ་དཀར་ཆག་ལ་ཞིབ་བལྟ་ཐེངས་ཤིག་བྱས། དེ་ནས་ལེའུ་རེ་རེ་བཞིན་ཞིབ་པར་བཀླགས་པ་ན། \n" +
			"     རྩོམ་འདིར་བོད་ཀྱི་སྤུ་རྒྱལ་ཐོག་མ་གཉའ་ཁྲི་བཙན་པོ་དང་འབྲེལ་བའི་རྒྱ་བོད་ཀྱི་ལོ་རྒྱུས་ཡིག་ཆ་ཕལ་ཆེ་བ་རྣམས་གུང་ལེགས་པར་བསྒྲིགས་ཤིང་།ད་ལྟའི་བར་རྒྱལ་ཁབ་ཕྱི་ནང་ཀུན་ཏུ་གཉའ་ཁྲི་བཙན་པོའི་སྐོར་བྲིས་པའི་བོད་རྒྱ་དབྱིན་གསུམ་གྱི་དཔྱད་རྩོམ་ཕལ་ཆེ་བའི་དཔྱད་འབྲས་ཀྱི་བཅུད་ཕྱུང་། དེ་ནས་དཔེ་རྒྱུན་དཀོན་པོ་དང་གསར་རྙེད་ཡིག་ཚང་དུ་མས་ཟུར་བརྒྱན་ཏེ། གཉའ་ཁྲི་བཙན་པོའི་རིགས་རུས་གདུང་ཁུངས་ནས་མཚན་དང་འཁྲུངས་འདས་ཀྱི་ལོ་ཚིགས། སྐུ་དང་མཚན་དཔེ། འཁོར་དང་ཡོ་བྱད། ཡུལ་ལུང་དབང་རིས། མཁར་དང་ཕོ་བྲང་། ཆོས་སྲིད་ཀྱི་མཛད་རྗེས་སོགས་ཀྱི་སྐོར་དང་། ཡང་རྒྱལ་པོ་འདི་དང་འབྲེལ་བའི་དཀོར་ནོར་རྫོང་སྐལ་དང་ཐེའུ་བྲང་སྐྱས་འདེབས། དམུ་ཐག་དམུ་སྐས། གཤེགས་རབས་ཉེར་བདུན། གནམ་ལྷ་བབས་སོགས་གནའ་བོའི་དཔེ་སྲོལ་ཆོ་ག་དང་དེའི་བཤད་པའི་སྐོར། གཞན་ཡང་རྒྱལ་པོ་ཐོག་མ་འདིའི་དབང་ཐང་གི་འབྱུང་ཁུངས་དང་རྗེ་འབངས་རྒྱལ་བློན་གྱི་འབྲེལ་བ་ཇི་ལྟར་བྱུང་ཞིང་འཕེལ་བའི་གནའ་བོའི་ཆོས་སྲིད་ཀྱི་གནས་བབ་དང་དེའི་ལུགས་མཐུན་གྱི་འབྱུང་རྐྱེན། རྒྱལ་པོའི་ལུགས་ཀྱི་སྤྱོད་ཚུལ་དང་རྣམ་བཞག་སོགས་ཀྱི་སྐོར་ལ་སྒོ་ཀུན་ནས་ཕྱོགས་ཡོངས་སུ་ཧ་ཅང་ཞིབ་ཚགས་དང་གཟབ་ནན་གྱིས་དཔྱད་པ་གཏིང་ཟབ་མོ་བཏང་འདུག\n" +
			"     དཔྱད་རྩོམ་འདིར་བོད་རྒྱ་དབྱིན་གསུམ་གྱི་དཔྱད་གཞིའི་ཡིག་ཆ་ཕུན་སུམ་ཚོགས་ཤིང་བརྗོད་བྱའི་སྤྱི་ཁོག་དབུབ་སྟངས་དང་ཡན་ལག་གི་ས་བཅད་ལེན་སྟངས། མཆན་བུ་འདོགས་སྟངས་དང་བཅས་པ་དེང་གི་རིག་གཞུང་ཞིབ་འཇུག་གི་ཕྱག་སྲོལ་ཚད་ལྡན་ཇི་བཞིན་གསལ་ཞིང་དག་ལ། ཁུངས་བཙུན་ཅིང་གནད་ལ་ཁེལ་བར་མ་ཟད། རྗོད་བྱེད་ཚིག་གི་སྡེབ་ལེགས་ཤིང་སྦྱོར་བ་བབ་ཆགས་པ། སྐབས་སྐབས་སུ་རེའུ་མིག་སོགས་ཀྱིས་གསལ་བར་བྱས་པས་ཀློག་བདེ་བ་སོགས་ཀྱི་ཁྱད་ཆོས་མངོན་གསལ་འདུག\n" +
			"     དེབ་འདི་དང་ཐོག2011ལོར་འབུམ་རམས་པའི་སློབ་གཉེར་མཐར་ཕྱིན་དཔྱད་རྩོམ་དུ་རྫོགས་པར་བྲིས་པ་དང་། ཕྱིས་སུ་དཔར་ལ་ཉེ་སྐབས་སུ་ཡང་བསྐྱར་བོད་རྒྱ་དབྱིན་གསུམ་གྱི་དཔྱད་གཞིའི་ཡིག་ཆ280ལྷག་དང་མཆན་བུ826ལྷག་གི་ལུང་ཁུངས་སོགས་གང་ཅིར་སླ་ཆོས་ཁྲལ་ཆོས་སུ་མ་སོང་བར་འཁུར་བསམ་ཆེ་བསྐྱེད་ཀྱིས་རེ་རེ་བཞིན་ཐོད་གཏུགས་ནས་ཉིན་མཚན་མགོ་སྦྲེལ་ཏེ་དཀའ་སྤྱད་སྙིང་རུས་ཆེན་པོས་འགྲུབ་པར་བྱས་པའི་བརྒྱུད་རིམ་ནི་ཤིན་ཏུ་རྗེས་སུ་ཡི་རང་གི་གནས་སུ་མཐོང་ཞིང་། དེབ་འདིའི་ནང་དྲངས་པའི་དཔྱད་གཞིའི་ཡིག་ཆ་འདི་དག་གཅིག་པུའི་སྟེང་ནས་བཤད་ནའང་། དེབ་འདི་ཞིབ་པར་བཀླགས་ནས་རྣམ་པར་དཔྱོད་མཁན་རྣམས་ལ་བོད་ཀྱི་གནའ་བོའི་ལོ་རྒྱུས་ཀྱི་ཡིག་ཚང་སྤྱི་དང་ཁྱད་པར་དུ་རྒྱལ་པོ་གཉའ་ཁྲི་བཙན་པོའི་གདུང་ཁུངས་བྱུང་རབས་ཀྱི་ཕྱོགས་ནས་བློ་སྐྱེད་དྲན་སྐུལ་གང་མང་སྩོལ་ངེས་ལགས་སོ། །\n" +
			"\n" +
			"རྩོམ་སྒྲིག་པ་ཤེར་དོན་གྱིས་སྤྱི་ལོའི་ཟླ་ཚེས2016.7.20ལ་སྦྱར། \n" +
			"ཀྲུང་གོའི་བོད་རིག་པ་དཔེ་སྐྲུན་ཁང་།\n" +
			"\n" +
			"རྩོམ་པ་པོ་ངོ་སྤྲོད།\n" +
			"\n" +
			"     གཡང་མོ་མཚོ་ནི1985ལོར་མཚོ་སྔོན་འབའ་རྫོང་དུ་སྐྱེས་ཤིང་། 2001ལོ་ནས2011ལོའི་བར་དུ་ཀྲུང་དབྱང་མི་རིགས་སློབ་གྲྭ་ཆེན་མོར་དངོས་གཞི་དང་ཤེས་རམས་པ། འབུམ་རམས་པ་བཅས་ཀྱི་སློབ་གཉེར་རིམ་པ་བཞིན་བརྒྱུད་དེ། 2011ལོར་བོད་ཀྱི་གནའ་བོའི་ལོ་རྒྱུས་དང་ཡིག་ཆའི་ཆེད་ལས་ཀྱི་འབུམ་རམས་པའི་མཚན་ཐོབ་བླངས། ད་ལྟ་ཀྲུང་དབྱང་མི་རིགས་སློབ་གྲྭ་ཆེན་མོའི་བོད་རིག་པའི་ཞིབ་འཇུག་སློབ་གླིང་དུ་དགེ་རྒན་གྱི་འགན་བཞེས་ཡོད།\n" +
			"     2009ལོར་ཨ་རིའི་བིར་ལྗི་ནེ་ཡ་སློབ་གྲྭ་ཆེན་མོ(University of Virginia)ནས་ལོ་གཅིག་ལ་སློབ་སྦྱོང་བྱས་ཤིང་། 2014ལོར་འཇར་མན་མོན་ཆེན་སློབ་གྲྭ་ཆེན་མོ(Ludwig-Maximilians-Universität)ནས་གདན་ཞུའི་ཞིབ་འཇུག་པའི་མིང་ཐོག་ནས་ལོ་གཅིག་གི་རིང་ལ་ཞིབ་འཇུག་དང་སློབ་ཁྲིད་བྱས།";

	@Override
	protected void onCreate(Bundle savedInstanceState)
	{
		super.onCreate(savedInstanceState);
		setContentView(R.layout.page_layout);
		scanview = (PageView) findViewById(R.id.scanview);
		List<String> items = new ArrayList<String>();
		List<String> Content_list = new ArrayList<>();
		int j = 0;
		int n = 10;
		String s = "རྩོམ་པ་པོ།";
		 int l = s.length();
		for (int i = 0; i < 8; i++) {
			items.add("a" + (i + 1) + " s");
			Content_list.add(str.substring(j,n));
			j = j+10;
			n = n+10;
		}
		adapter = new ScanViewAdapter(this, items,Content_list);
		scanview.setAdapter(adapter);
	}

	@Override
	public boolean onCreateOptionsMenu(Menu menu)
	{
		getMenuInflater().inflate(R.menu.main, menu);
		return true;
	}

}
